Autodesk.Revit.DB.Mechanical.DuctSizes.GetDuctSizeIteratorInternal
Returns a DuctSizeIterator to the MEP duct sizes.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizes.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator(MEPSize) object that can be used to iterate through key-value pairs in the collection.